ryankurte/efm32-base/emdrv/rtcdrv/src/rtcdriver.c
   @details
   The source files for the RTCDRV device driver library resides in the
   emdrv/rtcdrv folder, and are named rtcdriver.c and rtcdriver.h.

   @li @ref rtcdrv_intro
   @li @ref rtcdrv_conf
   @li @ref rtcdrv_api
   @li @ref rtcdrv_example

   @n @section rtcdrv_intro Introduction

   The RTCDRV driver use the RTC peripheral of a device in Silicon Laboratories
   Gecko microcontroller family to provide a user configurable number of software
   millisecond timers.
   Two kinds of timers are supported; oneshot timers and periodic timers.
   Timers will, when their timeout period has expired, call a user supplied
   callback function.
   @note The callback function is called from within an interrupt handler with
   interrupts disabled.

   In addition to the timers, RTCDRV also offers an optional wallclock
   functionality. The wallclock keeps track of the number of seconds elapsed
   since RTCDRV was initialized.

   @n @section rtcdrv_conf Configuration Options

   Some properties of the RTCDRV driver are compile-time configurable. These
   properties are stored in a file named @ref rtcdrv_config.h. A template for this
   file, containing default values, resides in the emdrv/config folder.
   Currently the configuration options are:
   @li The number of timers that RTCDRV provides.
   @li Inclusion of the wallclock functionality.
   @li Integration with SLEEP driver.

   When integration with the SLEEP driver is enabled, RTCDRV will keep the
   SLEEP driver updated with regards to which energy mode that can be
   safely used.

   To configure RTCDRV, provide your own configuration file. Here is a
   sample @ref rtcdrv_config.h file:
   @verbatim
#ifndef SILICON_LABS_RTCDRV_CONFIG_H
#define SILICON_LABS_RTCDRV_CONFIG_H

// Define how many timers RTCDRV provide.
#define EMDRV_RTCDRV_NUM_TIMERS     (4)

// Uncomment the following line to include wallclock functionality.
//#define EMDRV_RTCDRV_WALLCLOCK_CONFIG

// Uncomment the following line to enable integration with SLEEP driver.
//#define EMDRV_RTCDRV_SLEEPDRV_INTEGRATION

// Uncomment one of the following lines to let RTCDRV clock on LFRCO or PLFRCO,
// the default is LFXO.
//#define EMDRV_RTCDRV_USE_LFRCO
//#define EMDRV_RTCDRV_USE_PLFRCO

#endif
   @endverbatim

   @n @section rtcdrv_api The API

   This section contain brief descriptions of the functions in the API. You will
   find detailed information on input and output parameters and return values by
   clicking on the hyperlinked function names. Most functions return an error
   code, @ref ECODE_EMDRV_RTCDRV_OK is returned on success,
   see @ref ecode.h and @ref rtcdriver.h for other error codes.

   Your application code must include one header file: @em rtcdriver.h.

   All functions defined in the API can be called from within interrupt handlers.

   @ref RTCDRV_Init(), @ref RTCDRV_DeInit() @n
    These functions initializes or deinitializes the RTCDRV driver. Typically
    @htmlonly RTCDRV_Init() @endhtmlonly is called once in your startup code.

   @ref RTCDRV_StartTimer(), @ref RTCDRV_StopTimer() @n
    Start/Stop a timer. When a timer expire, a user supplied callback function
    is called. A pointer to this function is passed to @htmlonly
    RTCDRV_StartTimer()@endhtmlonly. Refer to @ref TimerCallback for details of
    the callback prototype.
    Note that it is legal to start an already started timer, it will then just
    be restarted with the new timeout value.

   @ref RTCDRV_AllocateTimer(), @ref RTCDRV_FreeTimer() @n
    Reserve/release a timer. Many functions in the API require a timer ID as
    input parameter. Use @htmlonly RTCDRV_AllocateTimer() @endhtmlonly to
    aquire such a reference.

   @ref RTCDRV_TimeRemaining() @n
    Get time left to timer expiry.

   @ref RTCDRV_Delay() @n
    Millisecond delay function. This is an "active wait" delay function.

   @ref RTCDRV_IsRunning() @n
    Check if a timer is running.

   @ref RTCDRV_GetWallClock(), @ref RTCDRV_SetWallClock() @n
    Get or set wallclock time.

   @ref RTCDRV_GetWallClockTicks32(), @ref RTCDRV_GetWallClockTicks64() @n
    Get wallclock time expressed as number of RTC/RTCC counter ticks, available
    both as 32bit and 64 bit values.

   @ref RTCDRV_MsecsToTicks(), @ref RTCDRV_SecsToTicks(),
   @ref RTCDRV_TicksToMsec(), @ref RTCDRV_TicksToSec() @n
    Conversion functions between seconds, milliseconds and RTC/RTCC
    counter ticks.

   @n @anchor TimerCallback <b>The timer expiry callback function:</b> @n
   The callback function, prototyped as @ref RTCDRV_Callback_t(), is called from
   within the RTC peripheral interrupt handler on timer expiry.
   @htmlonly RTCDRV_Callback_t( RTCDRV_TimerID_t id )@endhtmlonly is called with
   the timer id as input parameter.

   @n <b>The timer type:</b> @n
   Timers are either of oneshot type or of periodic type.
   @li Oneshot timer run only once toward their expiry.
   @li Periodic timers will be automatically restartet when they expire.

   The timer type is an enumeration, see @ref RTCDRV_TimerType_t for details.

   @n @section rtcdrv_example Example
   @verbatim
#include "rtcdriver.h"
#include <stddef.h>

int i = 0;
RTCDRV_TimerID_t id;

void myCallback( RTCDRV_TimerID_t id, void * user )
{
  (void) user; // unused argument in this example

  i++;

  if ( i < 10 ) {
    // Restart timer
    RTCDRV_StartTimer( id, rtcdrvTimerTypeOneshot, 100, myCallback, NULL );
  }
}

int main( void )
{
  // Initialization of RTCDRV driver
  RTCDRV_Init();

  // Reserve a timer
  RTCDRV_AllocateTimer( &id );

  // Start a oneshot timer with 100 millisecond timeout
  RTCDRV_StartTimer( id, rtcdrvTimerTypeOneshot, 100, myCallback, NULL );

  return 0;
}
   @endverbatim

 * @} end group RTCDRV ********************************************************
 * @} end group emdrv ****************************************************/
